#+title: CSS Vars & Design Token

#+BEGIN_SRC sh :results output
cd .. && npm run test:coverage 2>&1
#+END_SRC

#+RESULTS:
#+begin_example
PASS ./test.tsx

  Function toCssVars
    ✓ toCssVars returns the expected flat list of css vars

  React integrations
    ✓ Computed style matches the expectation from the token
    ✓ Computed style matches the other theme upon toggling

---------------------------|---------|----------|---------|---------|-------------------
File                       | % Stmts | % Branch | % Funcs | % Lines | Uncovered Line #s
---------------------------|---------|----------|---------|---------|-------------------
All files                  |   85.29 |       40 |   85.71 |   83.87 |
 css-vars-design-token.tsx |   85.29 |       40 |   85.71 |   83.87 | 19,27,32-35,43
---------------------------|---------|----------|---------|---------|-------------------

Test Suites: 1 passed, 1 total
Tests:       3 passed, 3 total
#+end_example
